fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
  <attributes>
    <name>Период</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СозданныеАкты</name>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Реализация</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СозданиеДокументовНаОснованииДоговоров(МесяцОтчета) Экспорт

	СписокДоговоров = СпискоДоговоровДляАктов(МесяцОтчета);

	Если СписокДоговоров.Пустой() Тогда
		ТекстШаблона = "За выбранный период данных нет";
		ОбщегоНазначения.СообщитьПользователю(ТекстШаблона);
		Возврат ТекстШаблона;
	Иначе
		ТаблицаДоговоров = СписокДоговоров.Выгрузить();
		МассивДанных = СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, МесяцОтчета);
	КонецЕсли;

	Возврат МассивДанных;

КонецФункции	

Функция СпискоДоговоровДляАктов(МесяцОтчета)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Договор КАК Договор
	|ПОМЕСТИТЬ ВТ_ДокументРеализации
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&МесяцОтчета, МЕСЯЦ) И КОНЕЦПЕРИОДА(&МесяцОтчета, МЕСЯЦ)
	|	И НЕ РеализацияТоваровУслуг.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= НАЧАЛОПЕРИОДА(&МесяцОтчета, МЕСЯЦ)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И НЕ ДоговорыКонтрагентов.Ссылка В
	|				(ВЫБРАТЬ
	|					ВТ_ДокументРеализации.Договор КАК Договор
	|				ИЗ
	|					ВТ_ДокументРеализации КАК ВТ_ДокументРеализации)
	|	И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= КОНЕЦПЕРИОДА(&МесяцОтчета, МЕСЯЦ)";

	Запрос.УстановитьПараметр("МесяцОтчета", МесяцОтчета);

	Возврат Запрос.Выполнить();

КонецФункции

Функция СоздатьДокументыРеализацияТоваровИУслуг(ТаблицаДоговоров, МесяцОтчета)

	МассивДанных = Новый Массив;

	Для Каждого Документ Из ТаблицаДоговоров Цикл

		ДокументМененджер = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		ДатаДокумента = ТекущаяДатаСеанса();
		ДокументМененджер.Дата = ?(ДатаДокумента > КонецМесяца(МесяцОтчета), КонецМесяца(МесяцОтчета), ДатаДокумента);
		ДокументМененджер.Организация = Документ.Договор.Организация;
		ДокументМененджер.Контрагент = Документ.Договор.Владелец;
		ДокументМененджер.Ответственный = Пользователи.ТекущийПользователь();
		ДокументМененджер.Основание = Документ.Договор;
		ДокументМененджер.Комментарий = СтрШаблон("Услуги за период с %1 по %2", Формат(НачалоМесяца(МесяцОтчета),
			"ДФ=dd.MM.yyyy;"), Формат(КонецМесяца(МесяцОтчета), "ДФ=dd.MM.yyyy;"));
		ЗаполнитьЗначенияСвойств(ДокументМененджер, Документ);
		ДокументМененджер.Записать(РежимЗаписиДокумента.Запись);
		ДокументМененджер.ВКМ_ВыполнитьАвтозаполнение();
		ДокументМененджер.Записать(РежимЗаписиДокумента.Запись);
		Если ДокументМененджер.ПроверитьЗаполнение() Тогда
			ДокументМененджер.Записать(РежимЗаписиДокумента.Проведение);
		Иначе
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Не проведен. %1 не прошел проверку на заполнение",
				ДокументМененджер.Ссылка));
		КонецЕсли;

		МассивДанных.Добавить(ДокументМененджер.Ссылка);

	КонецЦикла;

	Возврат МассивДанных;

КонецФункции

#КонецОбласти

#КонецЕсли
